# Connecting SQLite

In [1]:
import pandas as pd
import sqlite3

In [3]:
!pip install ipython-sql

Collecting ipython-sql
  Using cached ipython_sql-0.5.0-py3-none-any.whl (20 kB)
Requirement already satisfied: six in e:\notebook\notebook_env\lib\site-packages (from ipython-sql) (1.16.0)
Collecting sqlalchemy>=2.0
  Using cached SQLAlchemy-2.0.31-cp39-cp39-win_amd64.whl (2.1 MB)
Collecting ipython-genutils
  Using cached ipython_genutils-0.2.0-py2.py3-none-any.whl (26 kB)
Requirement already satisfied: ipython in e:\notebook\notebook_env\lib\site-packages (from ipython-sql) (8.18.1)
Collecting sqlparse
  Using cached sqlparse-0.5.0-py3-none-any.whl (43 kB)
Collecting prettytable
  Using cached prettytable-3.10.0-py3-none-any.whl (28 kB)
Requirement already satisfied: typing-extensions>=4.6.0 in e:\notebook\notebook_env\lib\site-packages (from sqlalchemy>=2.0->ipython-sql) (4.12.2)
Collecting greenlet!=0.4.17
  Using cached greenlet-3.0.3-cp39-cp39-win_amd64.whl (290 kB)
Requirement already satisfied: exceptiongroup in e:\notebook\notebook_env\lib\site-packages (from ipython->ipython-sql) (1.2.1)
Requirement already satisfied: pygments>=2.4.0 in e:\notebook\notebook_env\lib\site-packages (from ipython->ipython-sql) (2.18.0)
Requirement already satisfied: decorator in e:\notebook\notebook_env\lib\site-packages (from ipython->ipython-sql) (5.1.1)
Requirement already satisfied: colorama in e:\notebook\notebook_env\lib\site-packages (from ipython->ipython-sql) (0.4.6)
Requirement already satisfied: jedi>=0.16 in e:\notebook\notebook_env\lib\site-packages (from ipython->ipython-sql) (0.19.1)
Requirement already satisfied: matplotlib-inline in e:\notebook\notebook_env\lib\site-packages (from ipython->ipython-sql) (0.1.7)
Requirement already satisfied: traitlets>=5 in e:\notebook\notebook_env\lib\site-packages (from ipython->ipython-sql) (5.14.3)
Requirement already satisfied: stack-data in e:\notebook\notebook_env\lib\site-packages (from ipython->ipython-sql) (0.6.3)
Requirement already satisfied: prompt-toolkit<3.1.0,>=3.0.41 in e:\notebook\notebook_env\lib\site-packages (from ipython->ipython-sql) (3.0.47)
Requirement already satisfied: parso<0.9.0,>=0.8.3 in e:\notebook\notebook_env\lib\site-packages (from jedi>=0.16->ipython->ipython-sql) (0.8.4)
Requirement already satisfied: wcwidth in e:\notebook\notebook_env\lib\site-packages (from prompt-toolkit<3.1.0,>=3.0.41->ipython->ipython-sql) (0.2.13)
Requirement already satisfied: executing>=1.2.0 in e:\notebook\notebook_env\lib\site-packages (from stack-data->ipython->ipython-sql) (2.0.1)
Requirement already satisfied: asttokens>=2.1.0 in e:\notebook\notebook_env\lib\site-packages (from stack-data->ipython->ipython-sql) (2.4.1)
Requirement already satisfied: pure-eval in e:\notebook\notebook_env\lib\site-packages (from stack-data->ipython->ipython-sql) (0.2.2)
Installing collected packages: greenlet, sqlparse, sqlalchemy, prettytable, ipython-genutils, ipython-sql
Successfully installed greenlet-3.0.3 ipython-genutils-0.2.0 ipython-sql-0.5.0 prettytable-3.10.0 sqlalchemy-2.0.31 sqlparse-0.5.0

WARNING: You are using pip version 21.1.3; however, version 24.1 is available.
You should consider upgrading via the 'e:\notebook\notebook_env\scripts\python.exe -m pip install --upgrade pip' command.

In [4]:
df = pd.DataFrame({'name': ['ramesh', 'suresh', 'mahesh', 'ganesh'],
                   'age': [12, 34, 25, 29],
                   'salary': [10000, 20000, 13400, 28480]})
df

     name  age  salary
0  ramesh   12   10000
1  suresh   34   20000
2  mahesh   25   13400
3  ganesh   29   28480

In [5]:
cnn = sqlite3.connect('jupyter_sql.db')

In [6]:
df.to_sql('employee', cnn)

4

In [2]:
%load_ext sql

In [3]:
%sql sqlite:///jupyter_sql.db

Connecting to 'sqlite:///jupyter_sql.db'

In [4]:
%%sql

select * from employee;

Running query in 'sqlite:///jupyter_sql.db'

+-------+--------+-----+--------+
| index |  name  | age | salary |
+-------+--------+-----+--------+
|   0   | ramesh |  12 | 10000  |
|   1   | suresh |  34 | 20000  |
|   2   | mahesh |  25 | 13400  |
|   3   | ganesh |  29 | 28480  |
+-------+--------+-----+--------+

# Connecting DuckDB

In [1]:
!pip install --quiet duckdb
!pip install --quiet jupysql
!pip install --quiet duckdb-engine

WARNING: You are using pip version 21.1.3; however, version 24.1 is available.
You should consider upgrading via the 'e:\notebook\notebook_env\scripts\python.exe -m pip install --upgrade pip' command.
WARNING: You are using pip version 21.1.3; however, version 24.1 is available.
You should consider upgrading via the 'e:\notebook\notebook_env\scripts\python.exe -m pip install --upgrade pip' command.
WARNING: You are using pip version 21.1.3; however, version 24.1 is available.
You should consider upgrading via the 'e:\notebook\notebook_env\scripts\python.exe -m pip install --upgrade pip' command.

In [1]:
import duckdb
import pandas as pd
# No need to import sqlalchemy or duckdb_engine
#  JupySQL will use SQLAlchemy to auto-detect the driver needed based on your connection string!

# Import jupysql Jupyter extension to create SQL cells
%load_ext sql

There's a new jupysql version available (0.10.17), you're running 0.10.10. To upgrade: pip install jupysql --upgrade
Deploy Flask apps for free on Ploomber Cloud! Learn more: https://ploomber.io/s/signup

We configure jupysql to return data as a Pandas dataframe and have less verbose output

In [2]:
%config SqlMagic.autopandas = True
%config SqlMagic.feedback = False
%config SqlMagic.displaycon = False

In [8]:
# Connect to a new or existing DuckDB database
conn = duckdb.connect('my_database.duckdb')

In [9]:
df = pd.DataFrame({'name': ['ramesh', 'suresh', 'mahesh', 'ganesh'],
                   'age': [12, 34, 25, 29],
                   'salary': [10000, 20000, 13400, 28480]})
df

     name  age  salary
0  ramesh   12   10000
1  suresh   34   20000
2  mahesh   25   13400
3  ganesh   29   28480

In [10]:
df.to_sql('employee', conn)

C:\Users\SAURABH PRAKASH\AppData\Local\Temp\ipykernel_5004\3500844613.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df.to_sql('employee', conn)

-1

In [11]:
%sql duckdb:///my_database.duckdb

# %sql duckdb:///:memory:
# %sql duckdb:///path/to/file.db

In [15]:
input_df = pd.DataFrame.from_dict({"i":[1, 2, 3],
                                  "j":["one", "two", "three"]})

In [16]:
%sql output_df << SELECT sum(i) as total_i FROM input_df
output_df # Sql output saved in Pandas dataframe

   total_i
0      6.0

In [20]:
%%sql 
select * from input_df

   i      j
0  1    one
1  2    two
2  3  three

In [22]:
%sql select * from input_df

   i      j
0  1    one
1  2    two
2  3  three

# Connecting PostgreSql

In [6]:
import pandas as pd

print("hello")

hello